{"title": "Why", "section": "Why", "id": "1", "text": "WHEREAS, Customer wishes to engage Contractor to provide certain services sought by Customer, as described in Exhibit(s) attached hereto (the “{Def.Services.Target}”); and", "source": "Sec/Why/0.md"}
{"title": "Why", "section": "Why", "id": "2", "text": "WHEREAS, Contractor is willing to provide such Services to Customer on the terms and conditions set forth in this Agreement, including the payment terms set forth in Section {Fee.Xnum} below.", "source": "Sec/Why/0.md"}
{"title": "Fees", "section": "Fees", "id": "1", "text": "The fees for the Services are as set forth in Exhibit(s) (the “{Def.Fees.Target}”).", "source": "Sec/Fees/0.md"}
{"title": "Fees", "section": "Fees", "id": "2", "text": "To the extent provided in Exhibit(s), Customer shall only reimburse Contractor for out-of-pocket expenses (collectively, “{Def.Expenses.Target}”) that Contractor obtains prior written approval and authorization from Customer before incurring such expense.   All Expense reimbursements (if any) shall be made at Contractor’s direct out-of-pocket costs, without any markup for overhead, rebates or bulk rate savings, administrative costs, or otherwise.", "source": "Sec/Fees/0.md"}
{"title": "Fees", "section": "Fees", "id": "3", "text": "All amounts payable to Contractor hereunder for Services or Expenses shall be payable in the ordinary course of business pursuant to a written invoice from Contractor submitted to Customer.", "source": "Sec/Fees/0.md"}
{"title": "Fees", "section": "Fees", "id": "4", "text": "All compensation to be paid to Contractor hereunder shall be paid without deduction or withholding of, and Contractor shall be solely responsible for and pay, all federal, state, local and foreign taxes due with respect thereto and all other deductions required by law.  Contractor agrees to indemnify Customer and hold it harmless from and against any liability, cost or expense (including, without limitation, court costs and attorney's fees) resulting from Contractor’s breach of any obligations under this paragraph.  Customer shall have the right to offset against any payments owing to Contractor any amounts that Contractor owes to Customer as a result of any breach of Contractor’s obligations under this Agreement.", "source": "Sec/Fees/0.md"}
{"title": "Term and Termination", "section": "Terminate", "id": "1", "text": "This Agreement shall be effective as of the Effective Date and shall continue in effect until the completion of the Services by Contractor or until earlier terminated as provided in this Agreement.", "source": "Sec/Terminate/0.md"}
{"title": "Term and Termination", "section": "Terminate", "id": "2", "text": "This Agreement may be terminated at any time for any reason, or no reason, by either party upon written notice to the other party.", "source": "Sec/Terminate/0.md"}
{"title": "Term and Termination", "section": "Terminate", "id": "3", "text": "Upon such termination, Customer shall pay Contractor for all services rendered and work performed up to the effective date of termination.", "source": "Sec/Terminate/0.md"}
{"title": "Term and Termination", "section": "Terminate", "id": "4", "text": "Upon any termination or expiration of this Agreement, for any reason, Contractor shall promptly (no later than within {Termination.DeliverWorkProduct.Period.days}) deliver to Customer all Work Product that was created prior to termination date, in accordance with Section {IP.Xnum} hereof, as well as all documentation evidencing Customer’s ownership rights thereof.", "source": "Sec/Terminate/0.md"}
{"title": "Indemnification", "section": "Indemnify", "id": "1", "text": "In performing Services under this Agreement, Contractor agrees not to design, develop, or provide to Customer any items that infringe one or more patents, copyrights, trademarks or other intellectual property rights (including trade secrets), privacy, or other rights of any person or entity.", "source": "Sec/Indemnify/0.md"}
{"title": "Indemnification", "section": "Indemnify", "id": "2", "text": "If Contractor becomes aware of any such possible infringement in the course of performing any Services hereunder, Contractor shall immediately so notify Customer in writing.", "source": "Sec/Indemnify/0.md"}
{"title": "Indemnification", "section": "Indemnify", "id": "3", "text": "Contractor shall indemnify and hold harmless Customer and its parents, subsidiaries and affiliates, and each of their directors, officers, shareholders, employees, agents and representatives (collectively, the “{Def.Indemnified_Parties.Target}”) for the amount of any and all liabilities, losses, damages, claims, costs and expenses, interest, awards, judgments and penalties (including, without limitation, any and all attorneys’ fees and expenses) suffered or incurred by any such {_Indemnified_Parties} arising from breach or default by Contractor of this Agreement or any Services performed hereunder, including any third-party claim that any aspect or use of the Work Product, or any Contractor Tools, infringes any intellectual property rights of a third-party.", "source": "Sec/Indemnify/0.md"}
{"title": "Indemnification", "section": "Indemnify", "id": "4", "text": "In the event of any infringement claimed by any third-party, or potential infringement identified by Customer or Contractor, Customer shall have the right to cause Contractor, at Contractor’s sole expense and at no additional charge to Customer, to promptly modify and repair any Work Product and to make conforming changes to the Work Product to the extent necessary to eliminate any such infringement (or potential infringement).", "source": "Sec/Indemnify/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "1.1", "text": "The parties hereby expressly agree that, except for the Contractor Tools (as defined below), sole and exclusive ownership of all right, title and interest, including all copyrights and other intellectual property rights, in and to the Work Product (as defined below) and any part thereof shall be owned by Customer without limitation as to time, territory or use.  Accordingly, Contractor hereby expressly transfers and assigns to Customer, upon creation of any Work Product, free and clear of all encumbrances and limitations, all rights, including all copyrights and other intellectual property rights, in the Work Product in any form or manner, in any state of production or completion, including all rights to make derivative works therefrom, in each case together with the right throughout the world in perpetuity to secure registrations, renewals and extensions of such copyrights or other intellectual property rights.  Customer shall make use of the Work Product as it solely shall deem appropriate, and shall have the right to edit, revise and adapt any of the Work Product for any purpose and in any manner as Customer deems necessary or appropriate.", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "1.2.1.0", "text": "For the purposes of this Agreement,", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "1.2.1.1", "text": "“{Def.Work_Product.Target}” shall include any and all Works of Contractor (as well as any other person or entity retained or commissioned by Contractor (each, a “{Def.Subcontractor.Target}”)) constituting in whole or in part, or in any way related to, the Services, including all drafts, additions to, deletions from, alterations of or revisions thereof.", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "1.2.1.2", "text": "“{Def.Works.Target}” shall mean all ideas, concepts, inventions, enhancements, designs, drawings, images, text, music, recordings, audio-visual content, copy, charts, plans and schematics, any source code, object code and other related content, documentation or materials.", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "1.2.1.00", "text": "Without limiting the foregoing, the parties agree that this Section {IP.Xnum} and the assignment hereunder shall apply to, and that the term “Work Product” as used in this Agreement includes and refers to, any and all Works created at any time, before or after the date hereof, by Contractor (alone or with others) or any other person on behalf of Customer, including without limitation any intellectual property created in connection with any services provided to Customer prior to the Effective Date. 1.2.1.=[G/Z/ol-none/s2]", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "1.2.2", "text": "Contractor shall deliver all Work Product as well as any other items reasonably necessary for the use of the Work Product to Customer or any client of Customer (“{Def.Client.Target}”) or other person designated by Customer.  All such materials and documentation shall be delivered in printed format and in electronic format, as may be applicable (source and object code, in any, shall be delivered in electronic format). 1.2.=[G/Z/ol-i/s2] 1.=[G/Z/paras/s2]", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "2.0", "text": "Contractor represents and covenants that:", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "2.1.1", "text": "each person employed by or that otherwise works, or may work with or for Contractor in connection the Services, that may create or contribute to, in part or in whole, any Work Product, before involvement in any Services, shall have executed an agreement for the benefit of Contractor pursuant to which such person has assigned and transferred to Contractor all rights in such Work Product, as a “work for hire” or otherwise, thereby enabling Contractor to assign and transfer all such rights in accordance with Section {IP.1.Xnum} above; and", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "2.1.2", "text": "each Subcontractor that creates or contributes to, in part or in whole, any Work Product shall have executed an agreement containing an assignment to Customer (identical in scope to Contractor’s assignment obligations under this Section {IP.Xnum}) of all such Subcontractor’s rights in such Work Product. 2.1.=[G/Z/ol-i/s2]", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "2.2", "text": "Contractor shall provide to Customer copies of all such agreements upon the conclusion of the Services, or earlier at Customer’s request.  Contractor hereby agrees to execute any such additional documents as may be requested by Customer or any Client to evidence Customer’s ownership of the Work Product. 2.=[G/Z/para/s2]", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "3", "text": "The Work Product shall not include any subject matter for which the copyright or other intellectual property is owned by a third-party and cannot be assigned to Customer.  In the event Contractor proposes to use in the Work Product any third-party content for which all rights cannot be assigned to Customer, then Contractor must obtain Customer’s prior written approval therefor.  In the event of such approval, Contractor shall obtain and provide to Customer all rights, releases, licenses and permits or other written authorization, as Customer may require, to enable Customer to use such subject matter in any form or manner throughout the world in perpetuity.  Contractor shall not include in the Work any open source software or public domain materials without Customer’s prior approval.  In the event that use of any open source software, Contractor shall provide Customer with a written list of such software and copies of all licenses for the use thereof in the Work.", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "4", "text": "Customer and Contractor also agree that the Services may require Contractor to use certain tools and features previously developed by Contractor (collectively, the “{Def.Contractor_Tools.Target}”).  Contractor shall retain all right, title, and interest in and to the Contractor Tools, but hereby grants to Customer and Customer hereby accepts, an irrevocable worldwide, royalty-free, non-exclusive, transferable and perpetual right and license to use the Contractor Tools as may be necessary to use for the use of the Work Product by Customer, and to license such rights to customers of Customer. Any assignment to Customer of inventions or Contractor Tools includes all rights of attribution, paternity, integrity, modification, disclosure and withdrawal, and any other rights throughout the world that may be known as or referred to as “moral rights,” “artist’s rights,” “droit moral,” or the like (collectively, “{Def.Moral_Rights.Target}”).  To the extent that {_Moral_Rights} cannot be assigned under applicable law, Contractor hereby waives and agrees not to enforce any and all {_Moral_Rights}, including, without limitation, any limitation on subsequent modification, to the extent permitted under applicable law.", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "5.0", "text": "Contractor warrants to Customer that:", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "5.1.1", "text": "the Services will be performed in a workmanlike and professional manner, consistent with generally accepted industry standards;", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "5.1.2", "text": "Contractor owns, and has the right to assign and transfer to Customer, in accordance with this Agreement, all intellectual property rights in the Work Product; and", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "5.1.3", "text": "none of the Work Product or any part thereof will infringe any copyrights, patents, trade secrets, or other proprietary rights of any third-party. 5.1.=[G/Z/ol-i/s3]", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "5.2", "text": "Contractor represents and warrants that all Work Product shall conform with applicable specifications, and that Contractor shall correct all errors, defects, inconsistencies, or malfunctions in any of the Work Product.", "source": "Sec/IP/0.md"}
{"title": "Intellectual Property Rights", "section": "IP", "id": "5.3", "text": "In no event shall Contractor include any of the following in the Work Product: text, graphics, sound, audio-visual content of any kind that might be viewed as offensive or related in any way to pornographic or sexually explicit material or any illegal activities; links to other websites that might be viewed as offensive or pornographic or sexually explicit material or any illegal activities; invisible text, metatags, or any other type of hidden text, hidden information, hidden graphics, or other hidden materials; or destructive elements or destructive programming of any type. 5.=[G/Z/para/s3] IP.1.Xnum={IP.Xnum}<a href=\"#IP.1.sec\" classs=\"definedterm\">(a)</a>", "source": "Sec/IP/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "1.1", "text": "Contractor agrees to refrain from using the Confidential Information for any purpose that would be adverse to the interests of Customer or any Client, and to hold the Confidential Information strictly confidential and not disclose it to any other person or entity except Contractor’s employees or authorized representatives who need to know such information, determined in Contractor’s sole discretion, and Contractor certifies that such employees or authorized representatives have previously signed agreements, either as a condition to employment or in order to obtain the Confidential Information, with Confidentiality terms and conditions at least as restrictive as those contained herein, such agreements to be provided to Disclosing Party upon request.", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "1.2.0", "text": "The foregoing obligations shall not apply to any information that", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "1.2.1", "text": "is publicly known at the time of its disclosure,", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "1.2.2", "text": "is lawfully received by Contractor from a third-party not under an obligation of confidentiality to Customer,", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "1.2.3", "text": "is published or otherwise made known to the public by Customer or", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "1.2.4", "text": "was generated independently by Contractor without reference to or the use of Confidential Information. 1.2.=[G/Z/ol-i/s4]", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "1.3", "text": "Contractor shall bear the burden of proof that any of the exclusions in the foregoing sentence shall apply in any case. 1.=[G/Z/para/s3]", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "2", "text": "Contractor further acknowledges that Customer has received and may in the future receive confidential and proprietary information from its Clients or third parties subject to a duty on Customer’s part to maintain the confidentiality of such information and, in some cases, to use it only for certain limited purposes.  Contractor agrees that Contractor owes Customer and such third parties, both during the term of this Agreement and thereafter, a duty to hold all such confidential or proprietary information in strictest confidence and not to disclose or use it in any manner that is not consistent with Customer’s agreement with such third parties, unless expressly authorized to do so by a duly authorized executive officer of Customer.", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "3.1", "text": "As between the parties, all Confidential Information, whether or not embodied in any Work, is and shall continue to be the exclusive property of Customer.  On the termination of this Agreement or at any time upon the request of Customer, Contractor shall deliver to Customer, or its designee, all of such Confidential Information and all other Customer property then in Contractor's actual or potential possession or control in any tangible or electronic form.  If Contractor and Customer agree that any specific Information or property cannot reasonably be delivered, Contractor shall provide evidence that such materials have been destroyed, including but not limited to, the purging or erasing of any and all computer records and data files.", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "3.2.0", "text": "For the purposes of this Agreement, “Confidential Information” means:", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "3.2.1", "text": "all Information acquired by Contractor from Customer, its employees, consultants, suppliers or customers, its agents or directors and officers, or others, during the term of this Agreement, that relates to the present or potential businesses, products or services of Customer or its Clients, as well as any other Information as may be designated by Customer as confidential or that a reasonable person would understand from the circumstances of the disclosure to be confidential;", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "3.2.2", "text": "all Information created or acquired by Contractor in the course of any Work; and", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "3.2.3", "text": "all Information that is derived in any way from any of the foregoing.", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "3.2.00", "text": "“{Def.Information.Target}” means all forms and types of financial, business, marketing, operations, scientific, technical, economic and engineering information, whether tangible or intangible, including without limitation, patterns, plans, compilations, devices, formulas, algorithms, designs, prototypes, methods, techniques, processes, procedures, programs, codes, know-how, computer software, databases, product names or marks, marketing materials or programs, plans, specifications, shop-practices, customer lists, customer information (including any personally identifiable information (PII)), supplier lists, engineering and manufacturing information, price lists, costing information, employee and consulting relationship information, accounting and financial data, profit margin, marketing and sales data, strategic plans, trade secrets and all other proprietary information, irrespective of the medium in which such Information is memorialized or communicated. 3.2.=[G/Z/ol-i/s3] 3.=[G/Z/paras/s2]", "source": "Sec/Conf/0.md"}
{"title": "Confidentiality", "section": "Conf", "id": "4", "text": "In no event shall any of the Services be performed for Customer at the facilities of a third-party or using the resources of a third-party.", "source": "Sec/Conf/0.md"}
